Rokasbarasa1/STM32-Quadcopter/src/main.c
uint32_t interrupt = 0;
uint32_t interrupt_end = 0;

// ------------------------------------------------------------------------------------------------------ Refresh rate
// Nyquist: sampling frequency must be at least double that of the highest frequency of interest
// The MPU6050 has a lowpass set to 260Hz we need to be able to manipulate all the frequencies until that. So 260 * 2 = 520
#define REFRESH_RATE_HZ 520

const uint16_t precalculated_timing_miliseconds = (1000000 / REFRESH_RATE_HZ);
// ------------------------------------------------------------------------------------------------------ handling loop timing
// Timing
// TODO: Change this variable to uint64 later
uint64_t absolute_microseconds_since_start = 0;
uint64_t loop_start_timestamp_microseconds = 0;
uint64_t delta_time_without_waiting_from_previous_loop_microseconds = 0;
uint64_t delta_time_total_loop_time_previous_loop_microseconds = 0;


uint16_t loop_start_microseconds = 0; // The timer is only 16 bits
uint16_t loop_start_miliseconds = 0; // Fallback if the microseconds overflew

// Keep track of time in each loop. Since loop start
uint32_t startup_time_microseconds = 0;
uint32_t delta_time = 0;
uint8_t time_since_startup_hours = 0;
uint8_t time_since_startup_minutes = 0;
uint8_t time_since_startup_seconds = 0;
uint16_t time_since_startup_ms = 0;
uint16_t time_since_startup_microseconds;

uint8_t entered_loop = 0;

// ------------------------------------------------------------------------------------------------------ Motor settings
const uint32_t dshot_refresh_rate = 500; // Hz

#define max_dshot600_throttle_value 2047
#define min_dshot600_throttle_value 48

#define max_dshot600_command_value 47
#define min_dshot600_command_value 1

#define dshot600_neutral_value 0
#define actual_min_dshot600_throttle_value 91 // Lowest value that lets the motors spin freely and at low rpm

// Take 75 percent of max because my battery can't handle all that current.
const uint16_t actual_max_dshot600_throttle_value = min_dshot600_throttle_value + ((max_dshot600_throttle_value - min_dshot600_throttle_value) * 50) / 100; // (max lipo amp rating / max draw of a bldc motor being used x 4) 0.917 * (max_pwm - min_pwm) + min_pwm = 371.4

// Motor 0 - BL, 1 - BR, 2 - FR, 3 - FL
float motor_power[] = {0.0, 0.0, 0.0, 0.0}; // Percent
float motor_frequency[] = {0.0, 0.0, 0.0, 0.0};
float motor_rpm[] = {0.0, 0.0, 0.0, 0.0};

float throttle_value = 0.0; 
uint8_t motor_rotor_poles = 14; // it is the 14 value from 12N14P of ECO II 2807

// Motor handles
uint8_t motor_BL;
uint8_t motor_BR;
uint8_t motor_FR;
uint8_t motor_FL;

// For calculations
uint16_t throttle_value_FR;
uint16_t throttle_value_FL;
uint16_t throttle_value_BL;
uint16_t throttle_value_BR;

// If REFRESH_RATE_HZ >= 500 HZ then the control loop will handle the bdshot600 sending
// else the interrupt on timer 3 will handle it
uint8_t manual_bdshot = 0;

// Used by the bdshot600 protocol for all the motors
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim){
    if(htim->Instance == TIM3){
        interrupt = DWT->CYCCNT;
        bdshot600_dma_send_all_motor_data();
        interrupt_end = DWT->CYCCNT;
    }
}

// Handlers for dma bdshot600 pins
// Without the handlers the DMA will crash the system
void DMA2_Stream1_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_BL));
}

void DMA2_Stream4_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_BR));
}

void DMA1_Stream6_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_FL));
}

void DMA1_Stream1_IRQHandler(void){
    HAL_DMA_IRQHandler(bdshot600_dma_get_dma_handle(motor_FR));
}

// ------------------------------------------------------------------------------------------------------ Sensor calibrations

// Convert readings from this site to same units nanoTeslas to microteslas
// https://www.ngdc.noaa.gov/geomag/calculators/magcalc.shtml#igrfwmm
// When calculating this remember that these values are already
// correcting and that the axis of the magnetometer are switched.

// For calibrating the magnetometer I
// used a method found in MicWro Engr Video:
// https://www.youtube.com/watch?v=MinV5V1ioWg
// Mag field norm at my location is 50.503
// use software called Magneto 1.2

// motor 2807

// Magnetometer MMC5603 OLD
// float magnetometer_hard_iron_correction[3] = {
//     3277.356074, 3277.609344, 3270.994236
// };

// float magnetometer_soft_iron_correction[3][3] = {
//     {1.001708, -0.003205, -0.007290},
//     {-0.003205, 0.975416, 0.056878},
//     {-0.007290, 0.056878, 1.061363}
// };


// // Magnetometer MMC5603 from SELF BALANCING ROBOT
// float magnetometer_hard_iron_correction[3] = {
//     3289.522250, 3294.622154, 3278.170824
// };

// float magnetometer_soft_iron_correction[3][3] = {
//     {1.094920, 0.000241, -0.010246},
//     {0.000241, 1.066263, 0.073343},
//     {-0.010246, 0.073343, 1.092661}
// };

// Magnetometer BMM350
float magnetometer_hard_iron_correction[3] = {
    24.261984, 25.381338, 8.991798
};

float magnetometer_soft_iron_correction[3][3] = {
    {1.084221, -0.002648, 0.031696},
    {-0.002648, 1.108312, -0.012211},
    {0.031696, -0.012211, 1.235721}
};

float magnetometer_ist8310_hard_iron_correction[3] = {
    -5.223590, -15.744763, -6.265561
};

float magnetometer_ist8310_soft_iron_correction[3][3] = {
    {1.163575, -0.013193, 0.051720},
    {-0.013193, 1.160624, 0.014889},
    {0.051720, 0.014889, 0.940670}
};



// Accelerometer
float accelerometer_correction[3] = {
    -0.022429, -0.334548, 0.952135
};

float accelerometer_scale_factor_correction[3][3] = {
    {1.007638,0.034535,0.012508},
    {0.034535,0.951928,-0.307391},
    {0.012508,-0.307391,0.969725}
};

// Gyro
float gyro_correction[3] = {
    -2.532809, 2.282250, 0.640916
};

float base_accelerometer_roll_offset = -1.2;
float base_accelerometer_pitch_offset = -0.76;

float accelerometer_roll_offset = 0;
float accelerometer_pitch_offset = 0;

// float yaw_offset = -43.8829; // -90 degrees is the default offset as this is to fix the orientation
// float yaw_offset = -50.439053; // -90 degrees is the default offset as this is to fix the orientation
float yaw_offset = -90.0; // -90 degrees is the default offset as this is to fix the orientation


// ------------------------------------------------------------------------------------------------------ Accelerometer values to degrees conversion
float accelerometer_roll = 0;
float accelerometer_pitch = 0;
float magnetometer_yaw = 0;
float magnetometer_yaw_no_tilt = 0.0;
float magnetometer_yaw_old = 0;
float magnetometer_yaw_ist8310 = 0;


