Rokasbarasa1/STM32-Quadcopter/src/main.c
float pressure_hpa = 0.0;
float temperature_celsius = 0.0;
float altitude_barometer = 0.0; // centimeters
float altitude_sensor_fusion = 0.0; // centimeters
uint8_t got_pressure = 0;

float vertical_acceleration_old = 0.0; // UNITS???
float vertical_acceleration = 0.0; // UNITS???

float vertical_velocity = 0.0; // UNITS???


uint8_t gps_position_hold_enabled = 0;
uint8_t gps_target_set = 0;
uint8_t gps_target_unset_logged = 1;

// 0 - pitch
// 1 - roll 
// 2 - radio off
uint8_t gps_target_unset_cause = 1; // For logging
float gps_target_unset_roll_value = 0.0f;
float gps_target_unset_pitch_value = 0.0f;

uint8_t use_gps_reset_count = 0;
uint8_t use_gps_reset_count_to_deactivate = 10; // This is done because sometimes some noise sends a neutural pitch and roll

float gps_hold_roll_adjustment_integral = 0.0;
float gps_hold_pitch_adjustment_integral = 0.0;

float gps_hold_roll_adjustment = 0.0f;
float gps_hold_pitch_adjustment = 0.0f;

float roll_effect_on_lat = 0;
float pitch_effect_on_lat = 0;

float roll_effect_on_lon = 0;
float pitch_effect_on_lon = 0;

// new method to control gps
float error_forward = 0.0f;
float error_right = 0.0f;


uint32_t last_got_gps_timestamp = 0;
uint32_t max_allowed_time_miliseconds_between_got_gps = 1000;


//Specific for ms5611
uint8_t ms5611_which_conversion = 0;// 0 - temperature, 1 - pressure
uint32_t ms5611_conversion_start_timestamp = 0;
uint32_t ms5611_min_pause_after_conversion_initiate_microseconds = 0; // Ask the driver what how many microseconds it needs to wait after initiating a conversion
uint32_t ms5611_loop_start_timestamp = 0;
uint32_t ms5611_set_reference_pressure_after_microseconds_of_loop = 4000000; // The actual pressure reading is only available some time into the loo. I do not know why.
uint8_t ms5611_reference_set = 0;

// Specific for yaw of magnetometer/gyro
uint8_t initial_yaw_set = 0;
uint32_t yaw_loop_start_timestamp = 0;
uint32_t yaw_set_yaw_after_microseconds_of_loop = 1000000; // The actual yaw reading is only available some time into the loop. I do not know why.
float yaw_magnetometer_only_gate_absolute_degrees = 0.1f; // Only magnetometer used bellow this value
float yaw_gyro_only_gate_absolute_degrees = 2.0f; // Only gyro used above this value


uint32_t amount_to_wait_for_gps_filtering_init = 2000000; // 2 seconds
// ------------------------------------------------------------------------------------------------------ Sensor fusion and filtering stuff
// 0.05 Drifts a lot
// 0.5 drift a bit
// 1.0 drift a bit
// 0.3 drift a bit
// 0.1 drift a bit more 
// Goal is to minimize drift while keeping as low as possible.

#define COMPLEMENTARY_RATIO_MULTIPLYER_FLIGHT 0.3f
#define COMPLEMENTARY_RATIO_MULTIPLYER_OFF 7.0f
#define COMPLEMENTARY_RATIO_MULTIPLYER_YAW_LOWER_GATE_MORE_GYRO 0.000f
#define COMPLEMENTARY_RATIO_MULTIPLYER_YAW_UPPER_GATE_MORE_MAG 0.001f // Increase until it starts doing edges on bumps
#define COMPLEMENTARY_RATIO_MULTIPLYER_YAW_USER_INPUT_MORE_MORE_MAG 0.01f // Increase until it starts doing edges on bumps

// // Good but not responsive enough in fast level yaw movement
// #define COMPLEMENTARY_RATIO_MULTIPLYER_YAW_GYRO_ONLY 0.000f
// #define COMPLEMENTARY_RATIO_MULTIPLYER_YAW_MAG_ONLY 0.004f // Increase until it starts doing edges on bumps

// float yaw_magnetometer_only_gate_absolute_degrees = 0.5f; // Only magnetometer used bellow this value
// float yaw_gyro_only_gate_absolute_degrees = 2.5f; // Only gyro used above this value

// #define COMPLEMENTARY_RATIO_MULTIPLYER 1.0f

float complementary_beta = 0.0;
float complementary_ratio = COMPLEMENTARY_RATIO_MULTIPLYER_OFF * (1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ)));

// This is used for filtering limits
float nyquist_with_margin = REFRESH_RATE_HZ / 2.0f - 6.0f; // The -6 is the margin that greatly improves the quality of filtering for notch filters

float motor_low_pass_filter_cutoff = 150;
struct low_pass_pt1_filter filter_motor_0;
struct low_pass_pt1_filter filter_motor_1;
struct low_pass_pt1_filter filter_motor_2;
struct low_pass_pt1_filter filter_motor_3;

float filtering_magnetometer_cutoff_frequency = 10;
struct low_pass_biquad_filter filter_magnetometer_x;
struct low_pass_biquad_filter filter_magnetometer_y;
struct low_pass_biquad_filter filter_magnetometer_z;


struct low_pass_biquad_filter filter_magnetometer_old_x;
struct low_pass_biquad_filter filter_magnetometer_old_y;
struct low_pass_biquad_filter filter_magnetometer_old_z;

struct low_pass_biquad_filter filter_magnetometer_old_old_x;
struct low_pass_biquad_filter filter_magnetometer_old_old_y;
struct low_pass_biquad_filter filter_magnetometer_old_old_z;

struct low_pass_biquad_filter filter_magnetometer_ist8310_x;
struct low_pass_biquad_filter filter_magnetometer_ist8310_y;
struct low_pass_biquad_filter filter_magnetometer_ist8310_z;

// Cutoff 20Hz sampling 520Hz
uint8_t magnetometer_iir_filter_order = 4;
float magnetometer_iir_filter_feedback[] = {1.0, -3.369238, 4.29911246, -2.45817706, 0.53083649}; // A
float magnetometer_iir_filter_feedforward[] = {0.00015837, 0.00063348, 0.00095021, 0.00063348, 0.00015837}; // B


struct iir_filter iir_filter_magnetometer_x;
struct iir_filter iir_filter_magnetometer_y;
struct iir_filter iir_filter_magnetometer_z;

// uint8_t moving_average_magetometer_size = 8; // Gives a cutoff of about 9
uint8_t moving_average_magetometer_size = 32; // Gives a cutoff of about 9

struct moving_average moving_average_magnetometer_x;
struct moving_average moving_average_magnetometer_y;
struct moving_average moving_average_magnetometer_z;

float outlier_detection_magnetometer_threshold = 3.0f;
uint8_t outlier_detection_magnetometer_window_size = 10;
struct outlier_detection outlier_detection_magnetometer_x;
struct outlier_detection outlier_detection_magnetometer_y;
struct outlier_detection outlier_detection_magnetometer_z;

float filtering_accelerometer_cutoff_frequency = 15;
struct low_pass_biquad_filter biquad_filter_accelerometer_x;
struct low_pass_biquad_filter biquad_filter_accelerometer_y;
struct low_pass_biquad_filter biquad_filter_accelerometer_z;

struct low_pass_pt1_filter filter_gyro_z;

const float filter_gyro_z_yaw_cutoff_frequency = 50; // 100 Hz was fine also

// Do not go higher in q than 1000
float rpm_notch_filter_q_harmonic_1 = 500;
float rpm_notch_filter_q_harmonic_3 = 200; // Stronger than the 1st harmonic

float rpm_notch_filter_min_frequency = 10; // Hz

