Rokasbarasa1/STM32-Quadcopter/src/main.c
struct notch_filter_q gyro_x_notch_filter_harmonic_1_motor_0;
struct notch_filter_q gyro_x_notch_filter_harmonic_1_motor_1;
struct notch_filter_q gyro_x_notch_filter_harmonic_1_motor_2;
struct notch_filter_q gyro_x_notch_filter_harmonic_1_motor_3;

struct notch_filter_q gyro_y_notch_filter_harmonic_1_motor_0;
struct notch_filter_q gyro_y_notch_filter_harmonic_1_motor_1;
struct notch_filter_q gyro_y_notch_filter_harmonic_1_motor_2;
struct notch_filter_q gyro_y_notch_filter_harmonic_1_motor_3;

// 2nd harmonic is not used as its not visible in the logs

struct notch_filter_q gyro_x_notch_filter_harmonic_3_motor_0;
struct notch_filter_q gyro_x_notch_filter_harmonic_3_motor_1;
struct notch_filter_q gyro_x_notch_filter_harmonic_3_motor_2;
struct notch_filter_q gyro_x_notch_filter_harmonic_3_motor_3;

struct notch_filter_q gyro_y_notch_filter_harmonic_3_motor_0;
struct notch_filter_q gyro_y_notch_filter_harmonic_3_motor_1;
struct notch_filter_q gyro_y_notch_filter_harmonic_3_motor_2;
struct notch_filter_q gyro_y_notch_filter_harmonic_3_motor_3;
// Z axis is filtered in other way

struct low_pass_biquad_filter roll_d_term_filtering;
struct low_pass_biquad_filter pitch_d_term_filtering;

float gyro_angular_for_d_term[] = {0,0,0};

const float d_term_filtering_min_cutoff = 75;
const float d_term_filtering_max_cutoff = 100;
const uint8_t d_term_filtering_expo = 7;

struct kalman_filter altitude_and_velocity_kalman;

const float altitude_barometer_filtering_min_cutoff = 2;
struct low_pass_biquad_filter altitude_barometer_filtering;

const float gps_filtering_min_cutoff = 3.0f;
// struct low_pass_biquad_filter biquad_filter_gps_lat;
// struct low_pass_biquad_filter biquad_filter_gps_lon;
struct low_pass_pt1_filter biquad_filter_gps_lat;
struct low_pass_pt1_filter biquad_filter_gps_lon;
// ------------------------------------------------------------------------------------------------------ Remote control settings
float max_yaw_attack = 80.0;
float max_roll_attack = 20;
float max_pitch_attack = 20;
float roll_attack_step = 0.2;
float pitch_attack_step = 0.2;
float max_throttle_vertical_velocity = 15; // cm/second

float max_angle_before_motors_off = 40;

float throttle = 0.0;
float yaw = 50.0;
float last_yaw = 50.0;
float pitch = 50.0;
float roll = 50.0;

float minimum_signal_timing_seconds = 0.2; // Seconds
uint64_t last_signal_timestamp_microseconds = 0;

// Changing pid chcanges which pid
// 0 - Acro mode
// 1 - angle mode
// 2 - all depending on flight mode set
//      flight mode 0 - acro mode pid
//      flight mode 1 - angle mode pid
//      flight mode 2 - altitude hold pid
//      flight mode 3 - gps hold pid
//      flight mode 4 - gps hild pid

uint8_t pid_change_mode = 2;

// ------------------------------------------------------------------------------------------------------ Logging to SD card
char log_file_base_name[] = "Quad.txt";
char log_file_base_name_gps[] = "QuadGPS.csv";
char log_file_base_name_alt[] = "QuadALT.csv";
char log_file_base_name_mag[] = "QuadMAG.txt";
char log_file_base_name_yaw[] = "QuadYAW.csv";
char log_file_base_name_timing[] = "QuadTIMING.csv";
char log_file_base_name_imu[] = "QuadIMU.csv";
char log_file_blackbox_base_name[] = "Quadcopter.BBL";
char *new_log_file_blackbox_base_name;
uint16_t blackbox_file_index = 0;
// Debug modes
// 0 - motor frequency
// 1 - imu data from drone
// 2 - vertical acceleration data instead of acro mode yaw data
const uint8_t blackbox_debug_mode = 2;
// 0 - acro mode
// 1 - angle mode
const uint8_t blackbox_log_angle_mode_pid = 1;
const uint8_t blackbox_write_repeat_logs_in_same_file = 1;

uint8_t sd_card_initialized = 0;
uint8_t log_loop_count = 0;
uint8_t sd_card_async = 0;

// 0 - complex async (faster)
// 1 - simple async
const uint8_t use_simple_async = 0;
const uint8_t use_blackbox_logging = 0;

// 0 - general logging
// 1 - gps logging
// 2 - vertical velocity logging
// 3 - magentometer raw data
// 4 - yaw data
// 5 - timing data
// 6 - imu data
// 7 - magentometer calibrated data
uint8_t txt_logging_mode = 4;
uint8_t txt_logged_header = 0;

void DMA1_Stream7_IRQHandler(void){
    HAL_DMA_IRQHandler(&hdma_spi3_tx);
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi){
    if (hspi->Instance == SPI3){
        sd_card_set_dma_transfer_call_status(0); // Set to zero as dma is not happening anymore
    }
}

// ------------------------------------------------------------------------------------------------------ Stuff for blackbox logging
uint32_t loop_iteration = 1;
float PID_proportional[5]; // acro roll, acro pitch, acro yaw, altitude hold outer, altitude hold inner
float PID_integral[5]; // acro roll, acro pitch, acro yaw, altitude hold outer, altitude hold inner
float PID_derivative[5]; // acro roll, acro pitch, acro yaw, altitude hold outer, altitude hold inner
float PID_feed_forward[3];
float PID_set_points[6]; // acro roll, acro pitch, acro yaw, throttle, altitude hold outer, altitude hold inner
float remote_control[4];

// ------------------------------------------------------------------------------------------------------ Flight mode settings
// Flight modes:
// (0) - acro
// (1) - angle
// (2) - angle with altitude hold
// (3) - angle with altitude hold and gps hold
// (4) - angle with gps hold and without altitude hold
uint8_t flight_mode = 4;

uint8_t use_angle_mode = 0;
uint8_t use_vertical_velocity_control = 0;
uint8_t use_gps_hold = 0;


//Logging motor off reason
uint32_t motor_off_index = 0;

float yaw_alpha = 0.0f;

int main(void){
    init_STM32_peripherals();
    accelerometer_roll_offset = base_accelerometer_roll_offset;
    accelerometer_pitch_offset = base_accelerometer_pitch_offset;
    // Turn off the blue led. Will show the status of sd logging later
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    printf("STARTING PROGRAM\n"); 
    
    HAL_Delay(500);
    
    if(init_drivers() == 0) return 0; // exit if initialization failed

    HAL_Delay(2000); // Dont want to interfere in calibration

    set_flight_mode(flight_mode);
    // check_calibrations();
    calibrate_gyro(); // Recalibrate the gyro as the temperature affects the calibration
    setup_logging_to_sd(0); // If stopped working then re-flash the firmware of the logger and check hardware connection. Check if it works when Li-po connected
    initialize_control_abstractions();
    initialize_motor_communication();
    get_initial_position();

    handle_pre_loop_start();
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;  
    DWT->CYCCNT = 0;                                // Reset the cycle counter
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    while (1){
        // Get current time
        handle_loop_start();
        DWT->CYCCNT = 0;

        radio = DWT->CYCCNT;
        handle_radio_communication();
        post_remote_control_step();
        radio_end = DWT->CYCCNT;

        sensors = DWT->CYCCNT;
        handle_get_and_calculate_sensor_values(); // Important do do this right before the pid stuff.
        sensors_end = DWT->CYCCNT;

        motor = DWT->CYCCNT;
        handle_pid_and_motor_control();
        motor_end = DWT->CYCCNT;

        logging = DWT->CYCCNT;
        handle_logging();
        logging_end = DWT->CYCCNT;

        handle_loop_end();

        // printf("ACCEL,%.2f,%.2f,%.2f;", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
        // printf("GYRO,%.2f,%.2f,%.2f;", gyro_angular[0], gyro_angular[1], gyro_angular[2]);
        // printf("MAG,%.2f,%.2f,%.2f;", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
        // if(loop_iteration % 20 == 0){
        //     printf("IMU,%.2f,%.2f,%.2f;", imu_orientation[0], imu_orientation[1], imu_orientation[2]);
        //     printf("\n");
        // }
        
        // printf("2r %lu\n", radio2 - radio);
        // printf("r %lu\n", radio_end - radio);

        // printf("2s %lu\n", sensors2 - sensors);
        // printf("3s %lu\n", sensors3 - sensors2);
        // printf("4s %lu\n", sensors4 - sensors3);
        // printf("5s %lu\n", sensors5 - sensors4);
        // printf("6s %lu\n", sensors6 - sensors5);
        // printf("7s %lu\n", sensors7 - sensors6);
        // printf("8s %lu\n", sensors8 - sensors7);
        // printf("9s %lu\n", sensors9 - sensors8);
        // printf("10s %lu\n", sensors10 - sensors9);
        // printf("11s %lu\n", sensors11 - sensors10);
        // printf("s %lu\n", sensors_end - sensors);

        // printf("2m %lu\n", motor2 - motor);
        // printf("3m %lu\n", motor3 - motor2);
        // printf("4m %lu\n", motor4 - motor3);
        // printf("5m %lu\n", motor5 - motor4);
        // printf("6m %lu\n", motor6 - motor6);
        // printf("7m %lu\n", motor7 - motor6);
        // printf("m %lu\n", motor_end - motor);

        // printf("2L %lu\n", logging2 - logging);
        // printf("3L %lu\n", logging3 - logging2);
        // printf("L %lu\n", logging_end - logging);

        // printf("IN %lu\n", interrupt_end - interrupt);

