Rokasbarasa1/STM32-Quadcopter/src/main.c
        // printf("cv_all %lu\n", bdshot600_dma_get_timings()[4] - bdshot600_dma_get_timings()[0]);
        // printf("cv_all2 %lu\n", bdshot600_dma_get_timings()[2] - bdshot600_dma_get_timings()[0]);
        // printf("cv_all3 %lu\n", bdshot600_dma_get_timings()[3] - bdshot600_dma_get_timings()[2]);
        // printf("cv_all5 %lu\n", bdshot600_dma_get_timings()[4] - bdshot600_dma_get_timings()[3]);

        // printf("pre_res %lu\n", bdshot600_dma_get_timings()[6] - bdshot600_dma_get_timings()[5]);

        // printf("cv_res %lu\n", bdshot600_dma_get_timings()[14] - bdshot600_dma_get_timings()[7]);
        // printf("cv_res8 %lu\n", bdshot600_dma_get_timings()[8] - bdshot600_dma_get_timings()[7]);
        // printf("cv_res9 %lu\n", bdshot600_dma_get_timings()[9] - bdshot600_dma_get_timings()[8]);
        // printf("cv_res10 %lu\n", bdshot600_dma_get_timings()[10] - bdshot600_dma_get_timings()[9]);
        // printf("cv_res11 %lu\n", bdshot600_dma_get_timings()[11] - bdshot600_dma_get_timings()[10]);
        // printf("cv_res12 %lu\n", bdshot600_dma_get_timings()[12] - bdshot600_dma_get_timings()[11]);
        // printf("cv_res13 %lu\n", bdshot600_dma_get_timings()[13] - bdshot600_dma_get_timings()[12]);
        // printf("cv_res14 %lu\n", bdshot600_dma_get_timings()[14] - bdshot600_dma_get_timings()[13]);

        // printf("cv_resin15 %lu\n", bdshot600_dma_get_timings()[15] - bdshot600_dma_get_timings()[8]);
        // printf("cv_resin16 %lu\n", bdshot600_dma_get_timings()[16] - bdshot600_dma_get_timings()[15]);
        // printf("cv_resin17 %lu\n", bdshot600_dma_get_timings()[17] - bdshot600_dma_get_timings()[16]);

        // printf("(%lu + %lu + %lu + %lu + %lu)/100000000 = %.5f\n\n", 
        //     radio_end - radio,
        //     sensors_end - sensors,
        //     motor_end - motor,
        //     logging_end - logging,
        //     interrupt_end - interrupt,
        //     ((float)(radio_end - radio) + (sensors_end - sensors) + (motor_end - motor) + (logging_end - logging) + (interrupt_end - interrupt)) / 100000000.0
        // );

        // printf("Motor BL: %5.1f BR: %5.1f FR: %5.1f FL: %5.1f\n",
        //     motor_rpm[0],
        //     motor_rpm[1],
        //     motor_rpm[2],
        //     motor_rpm[3]
        // );

        // printf("%.1f\n",
        //     motor_rpm[0]
        // );


    }
}


uint8_t init_drivers(){
    printf("-----------------------------INITIALIZING MODULES...\n");
    // Scan and see what i2c devices are there on the bus
    i2c_scan_bus(&hi2c1);

    // uint8_t mmc5603 = mmc5603_init(&hi2c1, 1, magnetometer_hard_iron_correction, magnetometer_soft_iron_correction, 1, 200, 1);
    // uint8_t qmc5883 = init_qmc5883l(&hi2c1, 1, magnetometer_hard_iron_correction, magnetometer_soft_iron_correction);
    // uint8_t hmc5883 = init_hmc5883l(&hi2c1, 1, magnetometer_hard_iron_correction, magnetometer_soft_iron_correction);
    uint8_t bmm350 = bmm350_init(
        &hi2c1, 
        1, 
        magnetometer_hard_iron_correction, 
        magnetometer_soft_iron_correction,
        BMM350_PAD_CTRL_ODR_400_HZ,
        BMM350_PAD_CTRL_AVG_NO_AVG
    );
    uint8_t ist8310 = ist8310_init(&hi2c1, 1, magnetometer_ist8310_hard_iron_correction, magnetometer_ist8310_soft_iron_correction);

    uint8_t mpu6050 = init_mpu6050(
        &hi2c1, 
        ACCEL_CONFIG_RANGE_2G, 
        GYRO_CONFIG_RANGE_500_DEG, 
        LOW_PASS_FILTER_FREQUENCY_CUTOFF_GYRO_260HZ_ACCEL_256HZ,
        1, 
        accelerometer_scale_factor_correction, 
        accelerometer_correction, 
        gyro_correction, 
        REFRESH_RATE_HZ, 
        complementary_ratio
    );


    uint8_t ms5611 = init_ms5611(&hi2c1);

    uint8_t bn357 = init_bn357(&huart2, &hdma_usart2_rx, 1);
    uint8_t nrf24 = init_nrf24(&hspi1, 1);

    printf("-----------------------------INITIALIZING MODULES DONE... ");

    if (mpu6050 && bmm350 && ms5611 && bn357 && nrf24){
        printf("OK\n");
    }else{
        printf("NOT OK\n");
        return 0;
    }

    // Initialize ms5611
    ms5611_min_pause_after_conversion_initiate_microseconds = ms5611_conversion_wait_time_microseconds();
    ms5611_set_prefered_data_conversion_preasure(MS5611_D1_CONVERSION_OSR_4096);
    ms5611_set_prefered_data_conversion_temperature(MS5611_D2_CONVERSION_OSR_4096);
 
    // Get the temperature
    ms5611_initiate_prefered_temperature_conversion();
    HAL_Delay(10); // 10ms delay to let the conversion finish
    temperature_celsius = ms5611_read_conversion_temperature_celsius();

    // Get the preasure
    ms5611_set_reference_pressure_from_number_of_samples(40);
    pressure_hpa = ms5611_read_conversion_preasure_hPa();

    // Start new preasure reading
    ms5611_initiate_prefered_preasure_conversion();
    ms5611_conversion_start_timestamp = get_absolute_time();

    // Continue initializing other peripherals
    nrf24_rx_mode(tx_address, 10);
    bn357_start_uart_interrupt();

    mpu6050_set_complementary_ratio(COMPLEMENTARY_RATIO_MULTIPLYER_OFF * (1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ))));

    // mpu6050_set_complementary_ratio_yaw(COMPLEMENTARY_RATIO_MULTIPLYER_YAW_UPPER_GATE_MORE_MAG * (1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ))));
    // yaw_alpha = COMPLEMENTARY_RATIO_MULTIPLYER_YAW_UPPER_GATE_MORE_MAG * (1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ)));

    mpu6050_set_complementary_ratio_yaw(COMPLEMENTARY_RATIO_MULTIPLYER_YAW_UPPER_GATE_MORE_MAG);
    yaw_alpha = COMPLEMENTARY_RATIO_MULTIPLYER_YAW_UPPER_GATE_MORE_MAG;

    return 1;
}

void handle_get_and_calculate_sensor_values(){
    // ------------------------------------------------------------------------------------------------------ Reset
    // Reset the values to make it easier to find broken sensor later
    reset_array_data(acceleration_data, 3);
    reset_array_data(gyro_angular, 3);
    reset_array_data(magnetometer_data, 3);
    got_pressure = 0;
    // temperature_celsius = 0.0f;
    // altitude_barometer = 0.0f;
    // vertical_velocity = 0.0f;

    // ------------------------------------------------------------------------------------------------------ Get the sensor data
    // Get data from motors
    if(bdshot600_dma_convert_all_responses(1)){
        // Motor 0 - BL, 1 - BR, 2 - FR, 3 - FL
        motor_frequency[0] = low_pass_filter_pt1_read(&filter_motor_0, bdshot600_dma_get_frequency(motor_BL));
        motor_frequency[1] = low_pass_filter_pt1_read(&filter_motor_1, bdshot600_dma_get_frequency(motor_BR));
        motor_frequency[2] = low_pass_filter_pt1_read(&filter_motor_2, bdshot600_dma_get_frequency(motor_FR));
        motor_frequency[3] = low_pass_filter_pt1_read(&filter_motor_3, bdshot600_dma_get_frequency(motor_FL));
    }

    sensors2 = DWT->CYCCNT;

    // Disable interrupts as they heavily impact the i2c communication
    __disable_irq();
    // Read preasure strictly every around 10 ms
    if(get_absolute_time() - ms5611_conversion_start_timestamp > ms5611_min_pause_after_conversion_initiate_microseconds){
        if(ms5611_which_conversion == 0){
            temperature_celsius = ms5611_read_conversion_temperature_celsius();
            ms5611_initiate_prefered_preasure_conversion();
            ms5611_which_conversion = 1;
        }else if(ms5611_which_conversion == 1){
            pressure_hpa = ms5611_read_conversion_preasure_hPa();
            got_pressure = 1;

            // ONLY ONCE, set the reference after some time into the loop
            if(ms5611_reference_set == 0 && get_absolute_time() - ms5611_loop_start_timestamp > ms5611_set_reference_pressure_after_microseconds_of_loop){
                ms5611_reference_set = 1;
                altitude_barometer = ms5611_get_height_centimeters_from_reference(1, 0, 1);
            }else{
                // NORMAL call
                altitude_barometer = ms5611_get_height_centimeters_from_reference(1, 0, 0);
            }
            ms5611_initiate_prefered_temperature_conversion();
            ms5611_which_conversion = 0;
        }
        ms5611_conversion_start_timestamp = get_absolute_time();
    }
    
