Rokasbarasa1/STM32-Quadcopter/src/main.c
    }
    sensors7 = DWT->CYCCNT;

    // Dynamic notch filtering
    // Not currently used

    // For testing
    if(txt_logging_mode == 4){

        magnetometer_data_current_unfiltered[0] = magnetometer_data[0];
        magnetometer_data_current_unfiltered[1] = magnetometer_data[1];
        magnetometer_data_current_unfiltered[2] = magnetometer_data[2];

        // Filter magnetometer data
        magnetometer_low_pass[0] = low_pass_filter_biquad_read(&filter_magnetometer_x, magnetometer_data[0]);
        magnetometer_low_pass[1] = low_pass_filter_biquad_read(&filter_magnetometer_y, magnetometer_data[1]);
        magnetometer_low_pass[2] = low_pass_filter_biquad_read(&filter_magnetometer_z, magnetometer_data[2]);

        magnetometer_data_simple_rotation[0] = low_pass_filter_biquad_read(&filter_magnetometer_old_x, magnetometer_data_simple_rotation[0]);
        magnetometer_data_simple_rotation[1] = low_pass_filter_biquad_read(&filter_magnetometer_old_y, magnetometer_data_simple_rotation[1]);
        magnetometer_data_simple_rotation[2] = low_pass_filter_biquad_read(&filter_magnetometer_old_z, magnetometer_data_simple_rotation[2]);

        magnetometer_data_unrotated[0] = low_pass_filter_biquad_read(&filter_magnetometer_old_old_x, magnetometer_data_unrotated[0]);
        magnetometer_data_unrotated[1] = low_pass_filter_biquad_read(&filter_magnetometer_old_old_y, magnetometer_data_unrotated[1]);
        magnetometer_data_unrotated[2] = low_pass_filter_biquad_read(&filter_magnetometer_old_old_z, magnetometer_data_unrotated[2]);
        
        if(got_ist8310_reading){
            magnetometer_data_ist8310[0] = low_pass_filter_biquad_read(&filter_magnetometer_ist8310_x, magnetometer_data_ist8310[0]);
            magnetometer_data_ist8310[1] = low_pass_filter_biquad_read(&filter_magnetometer_ist8310_y, magnetometer_data_ist8310[1]);
            magnetometer_data_ist8310[2] = low_pass_filter_biquad_read(&filter_magnetometer_ist8310_z, magnetometer_data_ist8310[2]);
        }
    }

    magnetometer_data[0] = outlier_detection_process(&outlier_detection_magnetometer_x, magnetometer_data[0]);
    magnetometer_data[1] = outlier_detection_process(&outlier_detection_magnetometer_y, magnetometer_data[1]);
    magnetometer_data[2] = outlier_detection_process(&outlier_detection_magnetometer_z, magnetometer_data[2]);

    magnetometer_data[0] = iir_filter_process(&iir_filter_magnetometer_x, magnetometer_data[0]);
    magnetometer_data[1] = iir_filter_process(&iir_filter_magnetometer_y, magnetometer_data[1]);
    magnetometer_data[2] = iir_filter_process(&iir_filter_magnetometer_z, magnetometer_data[2]);

    magnetometer_data[0] = moving_average_process(&moving_average_magnetometer_x, magnetometer_data[0]);
    magnetometer_data[1] = moving_average_process(&moving_average_magnetometer_y, magnetometer_data[1]);
    magnetometer_data[2] = moving_average_process(&moving_average_magnetometer_z, magnetometer_data[2]);




    // Yaw Angular rotation filtering
    gyro_angular[2] = low_pass_filter_pt1_read(&filter_gyro_z, gyro_angular[2]);

    // Filter accelerometer data
    acceleration_data[0] = low_pass_filter_biquad_read(&biquad_filter_accelerometer_x, acceleration_data[0]);
    acceleration_data[1] = low_pass_filter_biquad_read(&biquad_filter_accelerometer_y, acceleration_data[1]);
    acceleration_data[2] = low_pass_filter_biquad_read(&biquad_filter_accelerometer_z, acceleration_data[2]);

    // Additional gyro filtering for d term
    // Adjust the filter cutoff 
    low_pass_filter_biquad_set_cutoff_frequency(
        &roll_d_term_filtering, 
        map_value_to_expo_range_inverted(
            throttle, 
            d_term_filtering_min_cutoff,
            d_term_filtering_max_cutoff,
            d_term_filtering_expo
        )
    ); // Use throttle, not the final output of the motor
    low_pass_filter_biquad_set_cutoff_frequency_using_reference_filter(&pitch_d_term_filtering, &roll_d_term_filtering);
    gyro_angular_for_d_term[0] = low_pass_filter_biquad_read(&roll_d_term_filtering, gyro_angular[0]);
    gyro_angular_for_d_term[1] = low_pass_filter_biquad_read(&pitch_d_term_filtering, gyro_angular[1]);

    sensors8 = DWT->CYCCNT;

    altitude_barometer = low_pass_filter_biquad_read(&altitude_barometer_filtering, altitude_barometer);

    // if(got_gps){
    //     // If distance to big then just use that as the new filtering base
    //     // if(lat_distance_to_target_meters > 100.0f || lat_distance_to_target_meters > 100.0f){
    //     //     low_pass_filter_biquad_set_initial_values(&biquad_filter_gps_lat, lat_distance_to_target_meters);
    //     //     low_pass_filter_biquad_set_initial_values(&biquad_filter_gps_lon, lon_distance_to_target_meters);
    //     // }else{
    //         lat_distance_to_target_meters = low_pass_filter_biquad_read(&biquad_filter_gps_lat, lat_distance_to_target_meters);
    //         lon_distance_to_target_meters = low_pass_filter_biquad_read(&biquad_filter_gps_lon, lon_distance_to_target_meters);
    //     // }
    // }

    // ------------------------------------------------------------------------------------------------------ Sensor fusion
    calculate_roll_pitch_from_accelerometer_data(acceleration_data, &accelerometer_roll, &accelerometer_pitch, accelerometer_roll_offset, accelerometer_pitch_offset); // Get roll and pitch from the data. I call it x and y. Ranges -90 to 90. 
    sensor_fusion_roll_pitch(gyro_angular, accelerometer_roll, accelerometer_pitch, loop_start_timestamp_microseconds, 1, imu_orientation);


    // Get yaw from magnetometer with tilt
    calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data, &magnetometer_yaw, imu_orientation[0], imu_orientation[1], yaw_offset);

    // Without tilt
    calculate_yaw_using_magnetometer_data(magnetometer_data, &magnetometer_yaw_no_tilt, yaw_offset);

    if(got_ist8310_reading){
        calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_ist8310, &magnetometer_yaw_ist8310, imu_orientation[0], imu_orientation[1], yaw_offset);
        // calculate_yaw_using_magnetometer_data(magnetometer_data_ist8310, &magnetometer_yaw_ist8310, yaw_offset);
    }


