Rokasbarasa1/STM32-Quadcopter/src/main.c
    if(txt_logging_mode == 4){
        // Same just different filtering
        calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_low_pass, &mangetometer_yaw_low_pass, imu_orientation[0], imu_orientation[1], yaw_offset);

        // Same just unfiltered
        calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_current_unfiltered, &mangetometer_yaw_unfiltered, imu_orientation[0], imu_orientation[1], yaw_offset);


        // Unrotated data with simple yaw
        calculate_yaw_using_magnetometer_data(magnetometer_data_unrotated, &mangetometer_yaw_unrotated_simple, -90.0f);

        // Simple rotation with tilt comp
        calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data_simple_rotation, &mangetometer_yaw_simple_rotation, imu_orientation[0], imu_orientation[1], 0.0);
    }

    // Set new yaw after some time
    if(initial_yaw_set == 0 && get_absolute_time() - yaw_loop_start_timestamp > yaw_set_yaw_after_microseconds_of_loop){
        initial_yaw_set = 1;
        imu_orientation[2] = magnetometer_yaw;
        gyro_yaw = magnetometer_yaw;
        gyro_yaw_old = magnetometer_yaw_old;
    }

    // acceleration_data_previous[0] = acceleration_data[0];
    // acceleration_data_previous[1] = acceleration_data[1];
    // acceleration_data_previous[2] = acceleration_data[2];

    // if (!initial_yaw_set) {
    //     // float gyro_magnitude = sqrtf(
    //     //     gyro_angular[0] * gyro_angular[0] +
    //     //     gyro_angular[1] * gyro_angular[1] +
    //     //     gyro_angular[2] * gyro_angular[2]
    //     // );

    //     // float accel_change = sqrtf(
    //     //     (acceleration_data[0] - acceleration_data_previous[0]) * (acceleration_data[0] - acceleration_data_previous[0]) +
    //     //     (acceleration_data[1] - acceleration_data_previous[1]) * (acceleration_data[1] - acceleration_data_previous[1]) +
    //     //     (acceleration_data[2] - acceleration_data_previous[2]) * (acceleration_data[2] - acceleration_data_previous[2])
    //     // );

    //     if (fabs(imu_orientation[0]) < 0.2f &&  // roll < 3°
    //         fabs(imu_orientation[1]) < 0.2f)  // pitch < 3°
    //     {
    //     // if (fabs(imu_orientation[0]) < 0.3f &&  // roll < 3°
    //     //     fabs(imu_orientation[1]) < 0.3f &&  // pitch < 3°
    //     //     gyro_magnitude < 0.1f &&            // not rotating
    //     //     accel_change < 0.05f)               // not being bumped
    //     // {
    //         initial_yaw_set = 1;
    //         imu_orientation[2] = magnetometer_yaw;
    //         gyro_yaw = magnetometer_yaw;
    //         gyro_yaw_old = magnetometer_yaw_old;
    //     }else{
    //         gps_target_unset_logged = 0;
    //         gps_target_unset_cause = 5;
    //         gps_can_be_used = 0;
    //     }
    // }


    // WHEN THE USER IS YAWING INCREASE THE MAGNETOMETER COMPONENT. WHEN HE IS NOT KEEP IT LOW LOW LOW
    // if(yaw != 50){
    //     yaw_alpha = COMPLEMENTARY_RATIO_MULTIPLYER_YAW_USER_INPUT_MORE_MORE_MAG;
    //     mpu6050_set_complementary_ratio_yaw(COMPLEMENTARY_RATIO_MULTIPLYER_YAW_USER_INPUT_MORE_MORE_MAG);
    // }else if(fabs(imu_orientation[0]) <= yaw_magnetometer_only_gate_absolute_degrees && fabs(imu_orientation[1]) <= yaw_magnetometer_only_gate_absolute_degrees){
    //     // MAG ONLY
    //     yaw_alpha = COMPLEMENTARY_RATIO_MULTIPLYER_YAW_UPPER_GATE_MORE_MAG;
    //     mpu6050_set_complementary_ratio_yaw(COMPLEMENTARY_RATIO_MULTIPLYER_YAW_UPPER_GATE_MORE_MAG);
    // }else if(fabs(imu_orientation[0]) >= yaw_gyro_only_gate_absolute_degrees && fabs(imu_orientation[1]) >= yaw_gyro_only_gate_absolute_degrees){
    //     yaw_alpha = COMPLEMENTARY_RATIO_MULTIPLYER_YAW_LOWER_GATE_MORE_GYRO;
    //     mpu6050_set_complementary_ratio_yaw(COMPLEMENTARY_RATIO_MULTIPLYER_YAW_LOWER_GATE_MORE_GYRO);
    //     // GYRO ONLY
    // }else{
    //     // SCALE BETWEEN MAG AND GYRO based on highest value of roll or pitch
    //     float max_deviation_from_zero = fmax(fabs(imu_orientation[0]), fabs(imu_orientation[1]));

    //     // map_value_to_expo_range_inverted()
    //     float new_alpha_value = map_value(
    //         max_deviation_from_zero, 
    //         yaw_magnetometer_only_gate_absolute_degrees,
    //         yaw_gyro_only_gate_absolute_degrees,
    //         COMPLEMENTARY_RATIO_MULTIPLYER_YAW_UPPER_GATE_MORE_MAG,
    //         COMPLEMENTARY_RATIO_MULTIPLYER_YAW_LOWER_GATE_MORE_GYRO
    //     );

    //     // Cap the value just in case
    //     if(new_alpha_value < 0.0f){
    //         new_alpha_value = 0.0f;
    //     }else if(new_alpha_value > 1.0f){
    //         new_alpha_value = 1.0f;
    //     }

    //     yaw_alpha = new_alpha_value;

    //     mpu6050_set_complementary_ratio_yaw(new_alpha_value);
    // }


    sensor_fusion_yaw(gyro_angular, magnetometer_yaw, loop_start_timestamp_microseconds, 1, imu_orientation, &gyro_yaw);

    // Extra imu logging
    if(txt_logging_mode == 6){
        float temp_old_gyro_angular[] = {0.0f,0.0f,0.0f};
        temp_old_gyro_angular[0] = (gyro_angular[0] / (1.0f / 65.5f)) * (1.0f / 131.0f);
        temp_old_gyro_angular[1] = (gyro_angular[1] / (1.0f / 65.5f)) * (1.0f / 131.0f);
        temp_old_gyro_angular[2] = gyro_angular[2];
        
        sensor_fusion_roll_pitch(temp_old_gyro_angular, accelerometer_roll, accelerometer_pitch, loop_start_timestamp_microseconds, 0, old_imu_orientation);
        calculate_yaw_tilt_compensated_using_magnetometer_data(magnetometer_data, &magnetometer_yaw_old, old_imu_orientation[0], old_imu_orientation[1], yaw_offset);
        sensor_fusion_yaw(temp_old_gyro_angular, magnetometer_yaw_old, loop_start_timestamp_microseconds, 0, old_imu_orientation, &gyro_yaw_old);
    }

    // No need for sensor fusion, it introduces delay
    // imu_orientation[2] = magnetometer_yaw;
    
    sensors9 = DWT->CYCCNT;
    // GPS STUFF
    float yaw_rad = (imu_orientation[2] + 0.0f) * M_DEG_TO_RAD;

    // yaw north facing is 0, east is 90, south is 180, west is 270
    // roll_effect_on_lat = sin(yaw_rad);
    // pitch_effect_on_lat = -cos(yaw_rad);
    // roll_effect_on_lon = -cos(yaw_rad);
    // pitch_effect_on_lon = -sin(yaw_rad);

    // This is just a rotation matrix in linear algebra rotate coordinates by degrees
    error_forward = lat_distance_to_target_meters * cosf(yaw_rad) + lon_distance_to_target_meters * sinf(yaw_rad);
    error_right   = -lat_distance_to_target_meters * sinf(yaw_rad) + lon_distance_to_target_meters * cosf(yaw_rad);


