Rokasbarasa1/STM32-Quadcopter/src/main.c
    // --------------------- TODO DO SOME CROSS AXIS CORRECTION (Gyro gimbal Lock/Transfer) for roll and pitch

    sensors10 = DWT->CYCCNT;
    // ------------------------------------------------------------------------------------------------------ Use sensor fused data for more data
    // vertical_acceleration_old = old_mpu6050_calculate_vertical_acceleration_cm_per_second(acceleration_data, imu_orientation);
    // vertical_acceleration = mpu6050_calculate_vertical_acceleration_cm_per_second(acceleration_data, imu_orientation);

    // kalman_filter_predict(&altitude_and_velocity_kalman, &vertical_acceleration);
    // kalman_filter_update(&altitude_and_velocity_kalman, &altitude_barometer);

    // altitude_sensor_fusion = kalman_filter_get_state(&altitude_and_velocity_kalman)[0][0];
    // vertical_velocity = kalman_filter_get_state(&altitude_and_velocity_kalman)[1][0];
    sensors11 = DWT->CYCCNT;

    // printf("Alt %f vel %f ", altitude_sensor_fusion, vertical_velocity);
    // printf("IMU %f %f %f\n", imu_orientation[0], imu_orientation[1], imu_orientation[2]);

    // printf("Lat %f, Lon %f\n", gps_latitude, gps_longitude);
    // printf("%f;%f;%f;\n", mangetometer_yaw_unfiltered, mangetometer_yaw_low_pass, magnetometer_yaw);

    // printf("YAW %f\n", mangetometer_yaw_low_pass);
}



void handle_pid_and_motor_control(){    

    // For the robot to do work it needs to be receiving radio signals and at the correct angles, facing up
    if(
        imu_orientation[0] >  max_angle_before_motors_off || 
        imu_orientation[0] < -max_angle_before_motors_off || 
        imu_orientation[1] >  max_angle_before_motors_off || 
        imu_orientation[1] < -max_angle_before_motors_off || 
        ((float)get_absolute_time() - (float)last_signal_timestamp_microseconds) / 1000000.0 > minimum_signal_timing_seconds
    ){  


        motor_off_index++;
        motor_off_index %= REFRESH_RATE_HZ;

        if(motor_off_index == 0){
            // DEBUG Why are motors off?
            if(imu_orientation[0] >  max_angle_before_motors_off){
                printf("MO ROLL+\n");
            }
            if(imu_orientation[0] < -max_angle_before_motors_off){
                printf("MO ROLL-\n");
            }
            if(imu_orientation[1] >  max_angle_before_motors_off){
                printf("MO PITCH+\n");
            }
            if(imu_orientation[1] < -max_angle_before_motors_off){
                printf("MO PITCH-\n");
            }
            if( ((float)get_absolute_time() - (float)last_signal_timestamp_microseconds) / 1000000.0 > minimum_signal_timing_seconds){
                printf("MO RADIO\n");
            }
        }



        // When not receiving signals, increase the complementary filter ratio to quickly smooth out any movements done by carrying the drone
        mpu6050_set_complementary_ratio(COMPLEMENTARY_RATIO_MULTIPLYER_OFF * (1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ))));
        // uint64_t timm_absolute = get_absolute_time();

        // float timessss = ((float)timm_absolute - (float)last_signal_timestamp_microseconds) / 1000000.0;
        // printf("STOP %.1f %.1f - %f %f %f %f %f\n", imu_orientation[0], imu_orientation[1], timessss, (float)timm_absolute, (float)absolute_microseconds_since_start,  (float)absolute_microseconds_since_start, (float)last_signal_timestamp_microseconds);

        // printf("b\n");
        throttle_value_FR = min_dshot600_throttle_value;
        throttle_value_FL = min_dshot600_throttle_value;
        throttle_value_BL = min_dshot600_throttle_value;
        throttle_value_BR = min_dshot600_throttle_value;

        // FPV cam side FRONT
        bdshot600_dma_set_throttle(throttle_value_FR, motor_FR); // Front-right
        bdshot600_dma_set_throttle(throttle_value_FL, motor_FL); // Front-left
        // GPS side BACK
        bdshot600_dma_set_throttle(throttle_value_BL, motor_BL); // Back-left
        bdshot600_dma_set_throttle(throttle_value_BR, motor_BR); // Back-right

        // For logging
        motor_power[0] = throttle_value_BL; // Logging
        motor_power[1] = throttle_value_FL; // Logging
        motor_power[2] = throttle_value_BR; // Logging
        motor_power[3] = throttle_value_FR; // Logging

        // Reset the remote control set points also
        remote_control[0] = 0;
        remote_control[1] = 0;
        remote_control[2] = 0;
        remote_control[3] = 0;

        PID_proportional[0] = 0; // Logging
        PID_proportional[1] = 0; // Logging
        PID_proportional[2] = 0; // Logging

        PID_integral[0] = 0; // Logging
        PID_integral[1] = 0; // Logging
        PID_integral[2] = 0; // Logging

        PID_derivative[0] = 0; // Logging
        PID_derivative[1] = 0; // Logging

        PID_set_points[0] = 0; // Logging
        PID_set_points[1] = 0; // Logging
        PID_set_points[2] = 0; // Logging
        PID_set_points[3] = 0; // Logging

        // gps_hold_roll_adjustment = 0.0f;
        // gps_hold_pitch_adjustment = 0.0f;

        pid_reset_integral_sum(&acro_roll_pid);
        pid_reset_integral_sum(&acro_pitch_pid);
        pid_reset_integral_sum(&acro_yaw_pid);

        pid_reset_integral_sum(&angle_pitch_pid);
        pid_reset_integral_sum(&angle_roll_pid);

        pid_reset_integral_sum(&altitude_hold_pid);
        pid_reset_integral_sum(&altitude_hold_pid);

        pid_reset_integral_sum(&gps_longitude_pid);
        pid_reset_integral_sum(&gps_latitude_pid);

        error_latitude = 0.0;
        error_longitude = 0.0;

        gps_hold_roll_adjustment = 0.0;
        gps_hold_pitch_adjustment = 0.0;

        if(got_gps){
            target_latitude = gps_latitude;
            target_longitude = gps_longitude;
            gps_target_unset_logged = 0;
            gps_target_unset_cause = 2;
        }

        // HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);

        //Set new target for the altitude
        target_altitude_barometer = altitude_barometer;
        // gyro_yaw = magnetometer_yaw;
        // gyro_yaw_old = magnetometer_yaw_old;

        // Immediately after getting the motor values send them to motors. If manual mode is on
        if(manual_bdshot) bdshot600_dma_send_all_motor_data();
        motor7 = DWT->CYCCNT;
        return;
    }
    // When receiving signals, decrease the complementary filter ratio to make the drone more responsive to gyro
    mpu6050_set_complementary_ratio(COMPLEMENTARY_RATIO_MULTIPLYER_FLIGHT * (1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ))));

