Rokasbarasa1/STM32-Quadcopter/src/main.c
    // ---------------------------------------------------------------------------------------------- GPS position hold
    if(use_gps_hold){
        // If the gps is not up to date then do not use it
        if(gps_position_hold_enabled && gps_can_be_used){
            pid_set_desired_value(&gps_latitude_pid, 0.0);
            pid_set_desired_value(&gps_longitude_pid, 0.0);

            // error_latitude = pid_get_error_own_error(&gps_latitude_pid, lat_distance_to_target_meters, loop_start_timestamp_microseconds);
            // error_longitude = pid_get_error_own_error(&gps_longitude_pid, lon_distance_to_target_meters, loop_start_timestamp_microseconds);

            // float gps_hold_roll_adjustment_calculation = roll_effect_on_lat * error_latitude + roll_effect_on_lon * error_longitude;
            // float gps_hold_pitch_adjustment_calculation = pitch_effect_on_lat * error_latitude + pitch_effect_on_lon * error_longitude;

            // if (gps_hold_roll_adjustment_calculation > gps_pid_angle_of_attack_max) gps_hold_roll_adjustment_calculation = gps_pid_angle_of_attack_max;
            // if (gps_hold_roll_adjustment_calculation < -gps_pid_angle_of_attack_max) gps_hold_roll_adjustment_calculation = -gps_pid_angle_of_attack_max;
            // if (gps_hold_pitch_adjustment_calculation > gps_pid_angle_of_attack_max) gps_hold_pitch_adjustment_calculation = gps_pid_angle_of_attack_max;
            // if (gps_hold_pitch_adjustment_calculation < -gps_pid_angle_of_attack_max) gps_hold_pitch_adjustment_calculation = -gps_pid_angle_of_attack_max;

            // gps_hold_roll_adjustment = gps_hold_roll_adjustment_calculation;
            // gps_hold_pitch_adjustment = gps_hold_pitch_adjustment_calculation;




            float roll_command = pid_get_error_own_error(&gps_longitude_pid, error_right, loop_start_timestamp_microseconds);
            float pitch_command = pid_get_error_own_error(&gps_latitude_pid, error_forward, loop_start_timestamp_microseconds);

            
            // if (roll_command + imu_orientation[0] > gps_pid_angle_of_attack_max) roll_command = gps_pid_angle_of_attack_max - imu_orientation[0];
            // if (roll_command + imu_orientation[0]< -gps_pid_angle_of_attack_max) roll_command = -gps_pid_angle_of_attack_max - imu_orientation[0];
            // if (pitch_command + imu_orientation[1] > gps_pid_angle_of_attack_max) pitch_command = gps_pid_angle_of_attack_max - imu_orientation[1];
            // if (pitch_command + imu_orientation[1] < -gps_pid_angle_of_attack_max) pitch_command = -gps_pid_angle_of_attack_max - imu_orientation[1];

            if (roll_command > gps_pid_angle_of_attack_max) roll_command = gps_pid_angle_of_attack_max;
            if (roll_command < -gps_pid_angle_of_attack_max) roll_command = -gps_pid_angle_of_attack_max;
            if (pitch_command > gps_pid_angle_of_attack_max) pitch_command = gps_pid_angle_of_attack_max;
            if (pitch_command < -gps_pid_angle_of_attack_max) pitch_command = -gps_pid_angle_of_attack_max;

            // gps_hold_roll_adjustment = roll_command;
            // gps_hold_pitch_adjustment = pitch_command;

            // Works better inverted
            gps_hold_roll_adjustment = -roll_command;
            gps_hold_pitch_adjustment = -pitch_command;


            // For logging
            PID_proportional[4] = pid_get_last_proportional_error(&gps_latitude_pid);
            PID_integral[4] = pid_get_last_integral_error(&gps_latitude_pid);
            PID_derivative[4] = pid_get_last_derivative_error(&gps_latitude_pid);



            // Length of the lat lon error vector
            // float error_magnitude = sqrtf(error_latitude * error_latitude + error_longitude * error_longitude);

            // // Get unit vectors of error lat and lon
            // float normalized_error_latitude = 0.0f;
            // float normalized_error_longitude = 0.0f;
            // if(error_magnitude == 0.0f){
            //     normalized_error_latitude = 0.0f;
            //     normalized_error_longitude = 0.0f;
            // }else{
            //     normalized_error_latitude = error_latitude / error_magnitude;
            //     normalized_error_longitude = error_longitude / error_magnitude;
            // }

            // float gps_hold_roll_adjustment_calculation = roll_effect_on_lat * normalized_error_latitude + roll_effect_on_lon * normalized_error_longitude;
            // float gps_hold_pitch_adjustment_calculation = pitch_effect_on_lat * normalized_error_latitude + pitch_effect_on_lon * normalized_error_longitude;

            // float scale_factor = fmin(error_magnitude, gps_pid_angle_of_attack_max);

            // gps_hold_roll_adjustment = gps_hold_roll_adjustment_calculation * scale_factor;
            // gps_hold_pitch_adjustment = gps_hold_pitch_adjustment_calculation * scale_factor;


        }else if(gps_position_hold_enabled && !gps_can_be_used){
            // Put in the same values'
            gps_hold_roll_adjustment = 0.0f;
            gps_hold_pitch_adjustment = 0.0f;
            // Rason for gps off
            if(gps_target_unset_logged != 0){
                gps_target_unset_logged = 0;
                gps_target_unset_cause = 3;
            }
        }else{
            gps_hold_roll_adjustment = 0.0f;
            gps_hold_pitch_adjustment = 0.0f;
            if(gps_target_unset_logged != 0){
                gps_target_unset_logged = 0;
                gps_target_unset_cause = 4;
            }
        }
    }
    motor2 = DWT->CYCCNT;
    

    // ---------------------------------------------------------------------------------------------- Altitude hold
    if(use_vertical_velocity_control && got_pressure){
        pid_set_desired_value(&altitude_hold_pid, target_altitude_barometer);
        pid_calculate_error(&altitude_hold_pid, altitude_barometer, loop_start_timestamp_microseconds);

        PID_proportional[3] = pid_get_last_proportional_error(&altitude_hold_pid);
        PID_integral[3] = pid_get_last_integral_error(&altitude_hold_pid);
        PID_derivative[3] = pid_get_last_derivative_error(&altitude_hold_pid);

        PID_set_points[4] = target_altitude_barometer;
        error_altitude_barometer = PID_proportional[3] + PID_integral[3] + PID_derivative[3];
    }

    motor3 = DWT->CYCCNT;

