Rokasbarasa1/STM32-Quadcopter/src/main.c
    // ---------------------------------------------------------------------------------------------- Angle mode
    if(use_angle_mode){ 
        pid_set_desired_value(&angle_roll_pid, angle_target_roll + gps_hold_roll_adjustment);
        pid_set_desired_value(&angle_pitch_pid, angle_target_pitch + gps_hold_pitch_adjustment);

        // For now not logging desired angle mode
        error_angle_roll = limit_max_value(pid_get_error(&angle_roll_pid, imu_orientation[0], loop_start_timestamp_microseconds), -acro_mode_rate_degrees_per_second, acro_mode_rate_degrees_per_second);
        error_angle_pitch = limit_max_value(pid_get_error(&angle_pitch_pid, imu_orientation[1], loop_start_timestamp_microseconds), -acro_mode_rate_degrees_per_second, acro_mode_rate_degrees_per_second);

    }else{
        error_angle_roll = 0;
        error_angle_pitch = 0;
    }

    motor4 = DWT->CYCCNT;

    // ---------------------------------------------------------------------------------------------- Acro mode
    if(use_angle_mode){
        pid_set_desired_value(&acro_roll_pid, error_angle_roll);
        pid_set_desired_value(&acro_pitch_pid, error_angle_pitch);
        pid_set_desired_value(&acro_yaw_pid, acro_target_yaw);
        
        PID_set_points[0] = error_angle_roll; // Logging
        PID_set_points[1] = error_angle_pitch; // Logging
        PID_set_points[2] = acro_target_yaw; // Logging
    }else{
        pid_set_desired_value(&acro_roll_pid, acro_target_roll);
        pid_set_desired_value(&acro_pitch_pid, acro_target_pitch);
        pid_set_desired_value(&acro_yaw_pid, acro_target_yaw);
        
        PID_set_points[0] = acro_target_roll; // Logging
        PID_set_points[1] = acro_target_pitch; // Logging
        PID_set_points[2] = acro_target_yaw; // Logging
    }
    

    // Just calculate and not get the error sum. Needed for d term filter
    pid_calculate_error_pi(&acro_roll_pid, gyro_angular[0], loop_start_timestamp_microseconds); // Calculate P and I terms
    pid_calculate_error_d(&acro_roll_pid, gyro_angular_for_d_term[0], loop_start_timestamp_microseconds); // Calculate D term using a low pass filtered value
    pid_set_previous_time(&acro_roll_pid, loop_start_timestamp_microseconds); // Update last timestamp

    pid_calculate_error_pi(&acro_pitch_pid, gyro_angular[1], loop_start_timestamp_microseconds);
    pid_calculate_error_d(&acro_pitch_pid, gyro_angular_for_d_term[1], loop_start_timestamp_microseconds);
    pid_set_previous_time(&acro_pitch_pid, loop_start_timestamp_microseconds);

    pid_calculate_error(&acro_yaw_pid, gyro_angular[2], loop_start_timestamp_microseconds);
    pid_set_previous_time(&acro_yaw_pid, loop_start_timestamp_microseconds);

    // printf("ROl g: %.3f gf: %.3f dt: %.3f \n", gyro_angular[0], gyro_angular_for_d_term[0], PID_derivative[0]);

    // Inner pid roll logging
    PID_proportional[0] = pid_get_last_proportional_error(&acro_roll_pid);
    PID_integral[0] = pid_get_last_integral_error(&acro_roll_pid);
    PID_derivative[0] = pid_get_last_derivative_error(&acro_roll_pid);

    // Inner pid pitch logging
    PID_proportional[1] = pid_get_last_proportional_error(&acro_pitch_pid);
    PID_integral[1] = pid_get_last_integral_error(&acro_pitch_pid);
    PID_derivative[1] = pid_get_last_derivative_error(&acro_pitch_pid);

    // Inner pid yaw logging
    PID_proportional[2] = pid_get_last_proportional_error(&acro_yaw_pid);
    PID_integral[2] = pid_get_last_integral_error(&acro_yaw_pid);




    // Use throttle to make the biquad filter dynamic
    error_acro_pitch = PID_proportional[1] + PID_integral[1] + PID_derivative[1];
    error_acro_roll = PID_proportional[0] + PID_integral[0] + PID_derivative[0];
    error_acro_yaw = PID_proportional[2] + PID_integral[2];

    if(blackbox_log_angle_mode_pid){
        // Outer pid roll logging
        PID_proportional[0] = pid_get_last_proportional_error(&angle_roll_pid);
        PID_integral[0] = pid_get_last_integral_error(&angle_roll_pid);
        PID_derivative[0] = pid_get_last_derivative_error(&angle_roll_pid);

        // Outer pid pitch logging
        PID_proportional[1] = pid_get_last_proportional_error(&angle_pitch_pid);
        PID_integral[1] = pid_get_last_integral_error(&angle_pitch_pid);
        PID_derivative[1] = pid_get_last_derivative_error(&angle_pitch_pid);
    }


    motor5 = DWT->CYCCNT;

    // ---------------------------------------------------------------------------------------------- Throttle
    error_throttle = throttle*0.9;

    // ---------------------------------------------------------------------------------------------- Applying to throttle to escs
    motor_power[0] = ( error_acro_roll) + ( error_acro_pitch) + ( error_acro_yaw);
    motor_power[1] = (-error_acro_roll) + ( error_acro_pitch) + (-error_acro_yaw);
    motor_power[2] = (-error_acro_roll) + (-error_acro_pitch) + ( error_acro_yaw);
    motor_power[3] = ( error_acro_roll) + (-error_acro_pitch) + (-error_acro_yaw);

    // For throttle control logic

    throttle_value = error_throttle * (~use_vertical_velocity_control & 1) + error_altitude_barometer * use_vertical_velocity_control;
    motor_power[0] += throttle_value;
    motor_power[1] += throttle_value;
    motor_power[2] += throttle_value;
    motor_power[3] += throttle_value;

    // For logging throttle value
    PID_set_points[3] = setServoActivationPercent(throttle_value, actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);

    throttle_value_FR = setServoActivationPercent(motor_power[2], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
    throttle_value_FL = setServoActivationPercent(motor_power[3], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
    throttle_value_BL = setServoActivationPercent(motor_power[0], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);
    throttle_value_BR = setServoActivationPercent(motor_power[1], actual_min_dshot600_throttle_value, actual_max_dshot600_throttle_value);

    // FPV cam side FRONT
    bdshot600_dma_set_throttle(throttle_value_FR, motor_FR); // Front-right
    bdshot600_dma_set_throttle(throttle_value_FL, motor_FL); // Front-left
    // GPS side BACK
    bdshot600_dma_set_throttle(throttle_value_BL, motor_BL); // Back-left
    bdshot600_dma_set_throttle(throttle_value_BR, motor_BR); // Back-right

    // For logging
    motor_power[0] = throttle_value_BL; // Logging BL <- BL
    motor_power[1] = throttle_value_FL; // Logging FL <- FL
    motor_power[2] = throttle_value_BR; // Logging BR <- BR
    motor_power[3] = throttle_value_FR; // Logging FR <- FR

