Rokasbarasa1/STM32-Quadcopter/src/main.c
    uint8_t skip_write = 0;

    if(sd_card_initialized){
        uint16_t data_size = 0;

        if(use_blackbox_logging){
            uint16_t data_size_data = 0;
            uint8_t* sd_card_buffer = (uint8_t*)sd_card_get_buffer_pointer(1);

            float angle_mode_targers[] = {angle_target_roll, angle_target_pitch};
            betaflight_blackbox_get_encoded_data_string(
                loop_iteration,
                time_blackbox,
                PID_proportional,
                PID_integral,
                PID_derivative,
                PID_feed_forward,
                remote_control,
                PID_set_points,
                gyro_angular,
                vertical_velocity,
                acceleration_data,
                motor_power,
                magnetometer_data,
                motor_frequency,
                imu_orientation,
                angle_mode_targers,
                altitude_barometer,
                &data_size_data,
                sd_card_buffer,
                blackbox_debug_mode
            );
            
            uint16_t data_size_gps = 0;
            if(got_gps){
                betaflight_blackbox_get_encoded_gps_string(
                    bn357_get_utc_time_raw(),
                    bn357_get_satellites_quantity(),
                    bn357_get_latitude_decimal_format(),
                    bn357_get_longitude_decimal_format(),
                    &data_size_gps, // it will append but not overwrite
                    sd_card_buffer + data_size_data // Offset the buffer, to not overwrite the data
                );
            }

            // printf("I %d\n", data_size_data);
            // printf("G %d\n", data_size_gps);

            data_size = data_size_data + data_size_gps;
            sd_card_buffer_increment_index_by_amount(data_size);
        }else{
            if(txt_logging_mode == 0){
                // TXT based logging
                // Log a bit of data
                // sd_card_append_to_buffer(1, "%02d:%02d:%02d:%03d;", time_since_startup_hours, time_since_startup_minutes, time_since_startup_seconds, time_since_startup_ms);
                // sd_card_append_to_buffer(1, "ACCEL,%.2f,%.2f,%.2f;", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
                // sd_card_append_to_buffer(1, "GYRO,%.2f,%.2f,%.2f;", imu_orientation[0], imu_orientation[1], imu_orientation[2]);
                // sd_card_append_to_buffer(1, "MAG,%.2f,%.2f,%.2f;", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
                // sd_card_append_to_buffer(1, "MOTOR,1=%.2f,2=%.2f,3=%.2f,4=%.2f;", motor_power[0], motor_power[1], motor_power[2], motor_power[3]);
                // sd_card_append_to_buffer(1, "ERROR,pitch=%.2f,roll=%.2f,yaw=%.2f,altitude=%.2f;", error_angle_pitch, error_angle_roll, error_acro_yaw, error_altitude);
                // sd_card_append_to_buffer(1, "TEMP,%.2f;", temperature_celsius);
                // sd_card_append_to_buffer(1, "ALT %.2f;", altitude_sensor_fusion);
                // sd_card_append_to_buffer(1, "GPS,lon-%f,lat-%f;", bn357_get_longitude_decimal_format(), bn357_get_latitude_decimal_format());
                // sd_card_append_to_buffer(1, "\n");

                // sd_card_append_to_buffer(1, "%6.5f %6.5f %6.5f", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);  
                // sd_card_append_to_buffer(1, "\n");
                
            }else if(txt_logging_mode == 1){ // Log gps target and current position
                if(got_gps){
                    // printf("s %f\n",gps_hold_roll_adjustment);
                    // target lat, target lon, lat, lon, roll_adjust, pitch_adjust, roll, pitch, yaw, sats, roll_effect_on_lat, pitch_effect_on_lat, roll_effect_on_lon, pitch_effect_on_lon, error_lat, error_lon
                    if(txt_logged_header == 0){
                        sd_card_append_to_buffer(1, "target lat;target lon;lat;lon;sattalites count;yaw;gyro yaw;mag yaw;gps roll;gps pitch;roll;pitch;lat distance to target meters;lon distance to target meters;extra info;\n");
                        txt_logged_header = 1;
                    }

                    sd_card_append_to_buffer(1, "%.1f;%.1f;%.1f;%.1f;%d;%.1f;%.1f;%.1f;%.1f;%.1f;%.1f;%.1f;", 
                        target_latitude * 1000000.0f,            // %f;
                        target_longitude * 1000000.0f,           // %f;
                        gps_latitude * 1000000.0f,               // %f;
                        gps_longitude * 1000000.0f,              // %f;
                        gps_satalittes_count,       // %d;
                        imu_orientation[2],         // %.1f;
                        gyro_yaw,
                        magnetometer_yaw,
                        gps_hold_roll_adjustment,   // %.1f;
                        gps_hold_pitch_adjustment,  // %.1f;
                        imu_orientation[0],         // %.1f;
                        imu_orientation[1]          // %.1f;
                    );

                    if(gps_target_unset_logged == 0){
                        // Set the distance to target meters as emptyu
                        sd_card_append_to_buffer(1, "0.0;0.0;");
                        // Log some reason for something happenning
                        if(gps_target_unset_cause == 1){
                            sd_card_append_to_buffer(1, "r%.3f;", 
                                gps_target_unset_roll_value
                            );
                        }else if(gps_target_unset_cause == 0){
                            sd_card_append_to_buffer(1, "p%.3f;", 
                                gps_target_unset_pitch_value
                            );
                        }else if(gps_target_unset_cause == 3){
                            sd_card_append_to_buffer(1, "gps_can_be_used;");
                        }else if(gps_target_unset_cause == 4){
                            sd_card_append_to_buffer(1, "gps_position_hold_enabled;");
                        }else if(gps_target_unset_cause == 2){
                            if(got_gps){
                                sd_card_append_to_buffer(1, "radoffgot;");
                            }else{
                                sd_card_append_to_buffer(1, "radoff;");
                            }
                        }else if(gps_target_unset_cause == 5){
                            sd_card_append_to_buffer(1, "not level;");
                        }
                        
                        gps_target_unset_logged = 1;
                    }else{
                        // Log tyhe distance to target and empty reason for something
                        sd_card_append_to_buffer(1, "%f;%f;;", 
                            lat_distance_to_target_meters,
                            lon_distance_to_target_meters
                        );
                    }

